## DataFrame数据读取

### （1）创建

In [2]:
# 创建方法1
import numpy as np
from pandas import Series,DataFrame
data1=np.random.randint(1,100,size=(4,3))
index1=['Eric','Jojouly','Alex','Rose']
columns1=['Python','Java','C++']
df1=DataFrame(data=data1,index=index1,columns=columns1)
df1

         Python  Java  C++
Eric         36    44   15
Jojouly      18    32   99
Alex         91    63   44
Rose         32    35   49

In [3]:
# 创建方法2
sr1=Series(np.random.randint(1,100,size=3),name='语文')
sr2=Series(np.random.random(3),name='数学')
# df2=DataFrame(data=[sr1,sr2]) #data中可以放多个series对象，但每个series对象都只能被当作一行来合并拼接成一个DF对象

#下面实现了在现有DF中任意添加列的操作
df2=DataFrame()
df2[sr1.name]=sr1.values
df2[sr2.name]=sr2.values
df2

   语文        数学
0  43  0.857619
1   3  0.161550
2  79  0.353807

In [9]:
# 创建方法3
dict1={
    '姓名':['张三','李四','王五','陈六','刘八'],
    '工资':[10000,20000,25000,30000,35000],
    '奖金':[15000,13000,14000,12000,11000],
}
df3=DataFrame(data=dict1)
df3

   姓名     工资     奖金
0  张三  10000  15000
1  李四  20000  13000
2  王五  25000  14000
3  陈六  30000  12000
4  刘八  35000  11000

### （2）读取

In [10]:
# 读取一行【注意：DataFrame读取一行时，可以用显式行索引读取<创建时需要用index声明>；也可用隐式行索引读取<隐式索引默认从0开始计数的下标>】
# df1.iloc[0]   #隐式行索引读取，返回一个子Series对象
# df1.iloc[0:1]   #隐式行索引切片读取，返回一个子DataFrame对象
# df1.loc['Eric']   #显式行索引读取，返回一个子Series对象
df1.loc[['Eric','Alex']]    #显式行索引列表方式读取，返回一个子Series对象
# df1.loc['Eric':'Alex']  ##显式行索引切片读取，返回一个子DataFrame对象
# df2.loc[0]    #显式和隐式相同的读取（因为：df2创建时为指定一个显式行索引，所以系统会自动把隐式行索引充当显式行索引来应用）

      Python  Java  C++
Eric      36    44   15
Alex      91    63   44

In [6]:
#读取一列
# df1.iloc[:,0]   #用隐式列索引来读取一整列，返回一个子DataFrame对象
# df1.loc['Alex','Java':'C++']    #用显式索引来读取指定行和列的区域，返回一个子DataFrame对象
# df1.loc[:,'Java':'C++']    #用显式索引来读取指定的多个整列，返回一个子DataFrame对象
# df1.iloc[:,1:]    #用显式索引来读取指定的多个整列，返回一个子DataFrame对象
df1.iloc[1:3,1:]    #用隐式索引来读取指定行和列的区域，返回一个子DataFrame对象

         Java  C++
Jojouly    32   99
Alex       63   44